{"publications":
    [
        {
            "authors": "Alon Albalak, Colin Raffel, and William Yang Wang",
            "url": "https://arxiv.org/abs/2302.00674",
            "title": "Improving Few-Shot Generalization by Exploring and Exploiting Auxiliary Data",
            "venue": "arXiv preprint arXiv:2302.00674",
            "day": 1,
            "month": 2,
            "year": 2023
        },
        {
            "authors": "Almog Gueta, Elad Venezian, Colin Raffel, Noam Slonim, Yoav Katz, and Leshem Choshen",
            "url": "https://arxiv.org/abs/2302.04863",
            "title": "Knowledge is a Region in Weight Space for Fine-tuned Language Models",
            "venue": "arXiv preprint arXiv:2302.04863",
            "day": 9,
            "month": 2,
            "year": 2023
        },
        {
            "authors": "Derek Tam, Colin Raffel, and Mohit Bansal",
            "url": "https://openreview.net/forum?id=UMxeP-FuwyC",
            "title": "Simple Weakly-Supervised Image Captioning via CLIP's Multimodal Embeddings",
            "venue": "AAAI Workshop on Creative AI Across Modalities",
            "day": 13,
            "month": 2,
            "year": 2023
        },
        {
            "authors": "Niklas Muennighoff, Alexander M. Rush, Boaz Barak, Teven Le Scao, Aleksandra Piktus, Nouamane Tazi, Sampo Pyysalo, Thomas Wolf, and Colin Raffel",
            "url": "https://arxiv.org/abs/2305.16264",
            "title": "Scaling Data-Constrained Language Models",
            "venue": "arXiv preprint arXiv:2305.16264",
            "day": 25,
            "month": 5,
            "year": 2023
        },
        {
            "authors": "Prateek Yadav, Derek Tam, Leshem Choshen, Colin Raffel, and Mohit Bansal",
            "url": "https://arxiv.org/abs/2306.01708",
            "title": "Resolving Interference When Merging Models",
            "venue": "arXiv preprint arXiv:2306.01708",
            "day": 2,
            "month": 6,
            "year": 2023
        },
        {
            "authors": "Mohammed Muqeeth, Haokun Liu, and Colin Raffel",
            "url": "https://arxiv.org/abs/2306.03745",
            "title": "Soft Merging of Experts with Adaptive Routing",
            "venue": "arXiv preprint arXiv:2206.03745",
            "day": 6,
            "month": 6,
            "year": 2023
        },
        {
            "authors": "Nikhil Kandpal*, Brian Lester*, Mohammed Muqeeth, Anisha Mascarenhas, Monty Evans, Vishal Baskaran, Tenghao Huang, Haokun Liu, and Colin Raffel",
            "url": "https://arxiv.org/abs/2306.04529",
            "title": "Git-Theta: A Git Extension for Collaborative Development of Machine Learning Models",
            "venue": "40th International Conference on Machine Learning",
            "day": 23,
            "month": 7,
            "year": 2023
        },
        {
            "authors": "Shachar Don-Yehiya, Elad Venezian, Colin Raffel, Noam Slonim, Yoav Katz, and Leshem Choshen",
            "url": "https://arxiv.org/abs/2212.01378",
            "title": "ColD Fusion: Collaborative Descent for Distributed Multitask Finetuning",
            "venue": "61st Annual Meeting of the Association for Computational Linguistics (ACL)",
            "day": 9,
            "month": 7,
            "year": 2023
        },
        {
            "authors": "Nikhil Kandpal, Haikang Deng, Adam Roberts, Eric Wallace, and Colin Raffel",
            "url": "https://arxiv.org/abs/2211.08411",
            "title": "Large Language Models Struggle to Learn Long-Tail Knowledge",
            "venue": "40th International Conference on Machine Learning",
            "day": 23,
            "month": 7,
            "year": 2023
        },
        {
            "authors": "Derek Tam*, Anisha Mascarenhas*, Shiyue Zhang, Sarah Kwan, Mohit Bansal, and Colin Raffel",
            "url": "https://arxiv.org/abs/2211.08412",
            "title": "Evaluating the Factual Consistency of Large Language Models Through Summarization",
            "venue": "Findings of the 61st Annual Meeting of the Association for Computational Linguistics (ACL)",
            "day": 9,
            "month": 7,
            "year": 2023
        },
        {
            "authors": "Teven Le Scao, Angela Fan, Christopher Akiki, Ellie Pavlick, Suzana Ilić, Daniel Hesslow, Roman Castagné, Alexandra Sasha Luccioni, François Yvon, Matthias Gallé, Jonathan Tow, Alexander M. Rush, Stella Biderman, Albert Webson, Pawan Sasanka Ammanamanchi, Thomas Wang, Benoît Sagot, Niklas Muennighoff, Albert Villanova del Moral, Olatunji Ruwase, Rachel Bawden, Stas Bekman, Angelina McMillan-Major, Iz Beltagy, Huu Nguyen, Lucile Saulnier, Samson Tan, Pedro Ortiz Suarez, Victor Sanh, Hugo Laurençon, Yacine Jernite, Julien Launay, Margaret Mitchell, Colin Raffel, Aaron Gokaslan, Adi Simhi, Aitor Soroa, Alham Fikri Aji, Amit Alfassy, Anna Rogers, Ariel Kreisberg Nitzav, Canwen Xu, Chenghao Mou, Chris Emezue, Christopher Klamm, Colin Leong, Daniel van Strien, David Ifeoluwa Adelani, Dragomir Radev, Eduardo González Ponferrada, Efrat Levkovizh, Ethan Kim, Eyal Bar Natan, Francesco De Toni, Gérard Dupont, Germán Kruszewski, Giada Pistilli, Hady Elsahar, Hamza Benyamina, Hieu Tran, Ian Yu, Idris Abdulmumin, Isaac Johnson, Itziar Gonzalez-Dios, Javier de la Rosa, Jenny Chim, Jesse Dodge, Jian Zhu, Jonathan Chang, Jörg Frohberg, Joseph Tobing, Joydeep Bhattacharjee, Khalid Almubarak, Kimbo Chen, Kyle Lo, Leandro Von Werra, Leon Weber, Long Phan, Loubna Ben allal, Ludovic Tanguy, Manan Dey, Manuel Romero Muñoz, Maraim Masoud, María Grandury, Mario Šaško, Max Huang, Maximin Coavoux, Mayank Singh, Mike Tian-Jian Jiang, Minh Chien Vu, Mohammad A. Jauhar, Mustafa Ghaleb, Nishant Subramani, Nora Kassner, Nurulaqilla Khamis, Olivier Nguyen, Omar Espejel, Ona de Gibert, Paulo Villegas, Peter Henderson , Pierre Colombo, Priscilla Amuok, Quentin Lhoest, Rheza Harliman, Rishi Bommasani, Roberto Luis López, Rui Ribeiro, Salomey Osei, Sampo Pyysalo, Sebastian Nagel, Shamik Bose, Shamsuddeen Hassan Muhammad, Shanya Sharma, Shayne Longpre, Somaieh Nikpoor, Stanislav Silberberg, Suhas Pai, Sydney Zink, Tiago Timponi Torrent, Timo Schick, Tristan Thrush, Valentin Danchev, Vassilina Nikoulina, Veronika Laippala, Violette Lepercq, Vrinda Prabhu, Zaid Alyafeai, Zeerak Talat, Arun Raja, Benjamin Heinzerling, Chenglei Si, Elizabeth Salesky, Sabrina J. Mielke, Wilson Y. Lee, Abheesht Sharma, Andrea Santilli, Antoine Chaffin, Arnaud Stiegler, Debajyoti Datta, Eliza Szczechla, Gunjan Chhablani, Han Wang, Harshit Pandey, Hendrik Strobelt, Jason Alan Fries, Jos Rozen, Leo Gao, Lintang Sutawika, M Saiful Bari, Maged S. Al-shaibani, Matteo Manica, Nihal Nayak, Ryan Teehan, Samuel Albanie, Sheng Shen, Srulik Ben-David, Stephen H. Bach, Taewoon Kim, Tali Bers, Thibault Fevry, Trishala Neeraj, Urmish Thakker, Vikas Raunak, Xiangru Tang, Zheng-Xin Yong, Zhiqing Sun, Shaked Brody, Yallow Uri, Hadar Tojarieh, Adam Roberts, Hyung Won Chung, Jaesung Tae, Jason Phang, Ofir Press, Conglong Li, Deepak Narayanan, Hatim Bourfoune, Jared Casper, Jeff Rasley, Max Ryabinin, Mayank Mishra, Minjia Zhang, Mohammad Shoeybi, Myriam Peyrounette, Nicolas Patry, Nouamane Tazi, Omar Sanseviero, Patrick von Platen, Pierre Cornette, Pierre François Lavallée, Rémi Lacroix, Samyam Rajbhandari, Sanchit Gandhi, Shaden Smith, Stéphane Requena, Suraj Patil, Tim Dettmers, Ahmed Baruwa, Amanpreet Singh, Anastasia Cheveleva, Anne-Laure Ligozat, Arjun Subramonian, Aurélie Névéol, Charles Lovering, Dan Garrette, Deepak Tunuguntla, Ehud Reiter, Ekaterina Taktasheva, Ekaterina Voloshina, Eli Bogdanov, Genta Indra Winata, Hailey Schoelkopf, Jan-Christoph Kalo, Jekaterina Novikova, Jessica Zosa Forde, Jordan Clive, Jungo Kasai, Ken Kawamura, Liam Hazan, Marine Carpuat, Miruna Clinciu, Najoung Kim, Newton Cheng, Oleg Serikov, Omer Antverg, Oskar van der Wal, Rui Zhang, Ruochen Zhang, Sebastian Gehrmann, Shani Pais, Tatiana Shavrina, Thomas Scialom, Tian Yun, Tomasz Limisiewicz, Verena Rieser, Vitaly Protasov, Vladislav Mikhailov, Yada Pruksachatkun, Yonatan Belinkov, Zachary Bamberger, Zdeněk Kasner, Alice Rueda, Amanda Pestana, Amir Feizpour, Ammar Khan, Amy Faranak, Ana Santos, Anthony Hevia, Antigona Unldreaj, Arash Aghagol, Arezoo Abdollahi, Aycha Tammour, Azadeh HajiHosseini, Bahareh Behroozi, Benjamin Ajibade, Bharat Saxena, Carlos Muñoz Ferrandis, Danish Contractor, David Lansky, Davis David, Douwe Kiela, Duong A. Nguyen, Edward Tan, Emi Baylor, Ezinwanne Ozoani, Fatima Mirza, Frankline Ononiwu, Habib Rezanejad, Hessie Jones, Indrani Bhattacharya, Irene Solaiman, Irina Sedenko, Isar Nejadgholi, Jesse Passmore, Josh Seltzer, Julio Bonis Sanz, Karen Fort, Livia Dutra, Mairon Samagaio, Maraim Elbadri, Margot Mieskes, Marissa Gerchick, Martha Akinlolu, Michael McKenna, Mike Qiu, Muhammed Ghauri, Mykola Burynok, Nafis Abrar, Nazneen Rajani, Nour Elkott, Nour Fahmy, Olanrewaju Samuel, Ran An, Rasmus Kromann, Ryan Hao, Samira Alizadeh, Sarmad Shubber, Silas Wang, Sourav Roy, Sylvain Viguier, Thanh Le, Tobi Oyebade, Trieu Le, Yoyo Yang, Zach Nguyen, Abhinav Ramesh Kashyap, Alfredo Palasciano, Alison Callahan, Anima Shukla, Antonio Miranda-Escalada, Ayush Singh, Benjamin Beilharz, Bo Wang, Caio Brito, Chenxi Zhou, Chirag Jain, Chuxin Xu, Clémentine Fourrier, Daniel León Periñán, Daniel Molano, Dian Yu, Enrique Manjavacas, Fabio Barth, Florian Fuhrimann, Gabriel Altay, Giyaseddin Bayrak, Gully Burns, Helena U. Vrabec, Imane Bello, Ishani Dash, Jihyun Kang, John Giorgi, Jonas Golde, Jose David Posada, Karthik Rangasai Sivaraman, Lokesh Bulchandani, Lu Liu, Luisa Shinzato, Madeleine Hahn de Bykhovetz, Maiko Takeuchi, Marc Pàmies, Maria A Castillo, Marianna Nezhurina, Mario Sänger, Matthias Samwald, Michael Cullan, Michael Weinberg, Michiel De Wolf, Mina Mihaljcic, Minna Liu, Moritz Freidank, Myungsun Kang, Natasha Seelam, Nathan Dahlberg, Nicholas Michio Broad, Nikolaus Muellner, Pascale Fung, Patrick Haller, Ramya Chandrasekhar, Renata Eisenberg, Robert Martin, Rodrigo Canalli, Rosaline Su, Ruisi Su, Samuel Cahyawijaya, Samuele Garda, Shlok S Deshmukh, Shubhanshu Mishra, Sid Kiblawi, Simon Ott, Sinee Sang-aroonsiri, Srishti Kumar, Stefan Schweter, Sushil Bharati, Tanmay Laud, Théo Gigant, Tomoya Kainuma, Wojciech Kusa, Yanis Labrak, Yash Shailesh Bajaj, Yash Venkatraman, Yifan Xu, Yingxin Xu, Yu Xu, Zhe Tan, Zhongli Xie, Zifan Ye, Mathilde Bras, Younes Belkada, and Thomas Wolf",
            "url": "https://arxiv.org/abs/2211.05100",
            "title": "BLOOM: A 176B-Parameter Open-Access Multilingual Language Model",
            "venue": "arXiv preprint arXiv:2211.05100",
            "day": 9,
            "month": 11,
            "year": 2022
        },
        {
            "authors": "Niklas Muennighoff, Thomas Wang, Lintang Sutawika, Adam Roberts, Stella Biderman, Teven Le Scao, M Saiful Bari, Sheng Shen, Zheng-Xin Yong, Hailey Schoelkopf, Xiangru Tang, Dragomir Radev, Alham Fikri Aji, Khalid Almubarak, Samuel Albanie, Zaid Alyafeai, Albert Webson, Edward Raff, and Colin Raffel",
            "url": "https://arxiv.org/abs/2211.01786",
            "title": "Crosslingual Generalization through Multitask Finetuning",
            "venue": "61st Annual Meeting of the Association for Computational Linguistics (ACL)",
            "day": 9,
            "month": 7,
            "year": 2023
        },
        {
            "authors": "Mohammed Muqeeth, Haokun Liu, and Colin Raffel",
            "url": "http://colinraffel.com/publications/icbinb2022models.pdf",
            "title": "Models with Conditional Computation Learn Suboptimal Solutions",
            "venue": "NeurIPS Workshop on Understanding Deep Learning Through Empirical Falsification (I Can't Believe It's Not Better)",
            "day": 3,
            "month": 12,
            "year": 2022
        },
        {
            "authors": "Colin Raffel",
            "url": "https://dl.acm.org/doi/10.1145/3545111",
            "title": "Building Machine Learning Models like Open-Source Software",
            "venue": "Communications of the Association for Computing Machinery (CACM)",
            "day": 1,
            "month": 2,
            "year": 2023
        },
        {
            "authors": "Martin Maas, David G. Andersen, Michael Isard, Mohammad Mahdi Javanmard, Kathryn S. McKinley, and Colin Raffel",
            "url": "http://colinraffel.com/publications/cacm2022combining.pdf",
            "title": "Combining Machine Learning and Lifetime-based Resource Management for Memory Allocation and Beyond",
            "venue": "Communications of the Association for Computing Machinery (CACM)",
            "day": 31,
            "month": 12,
            "year": 2023,
            "note": "CACM Research Highlight"
        },
        {
            "authors": "Michael Matena and Colin Raffel",
            "url": "https://arxiv.org/abs/2210.00176",
            "title": "A Combinatorial Perspective on the Optimization of Shallow ReLU Networks",
            "venue": "Neural Information Processing Systems 36 (NeurIPS)",
            "day": 29,
            "month": 11,
            "year": 2022
        },
        {
            "authors": "Zhenlin Xu, Marc Niethammer, and Colin Raffel",
            "url": "https://arxiv.org/abs/2210.00482",
            "title": "Compositional Generalization in Unsupervised Compositional Representation Learning: A Study on Disentanglement and Emergent Language",
            "venue": "Neural Information Processing Systems 36 (NeurIPS)",
            "day": 29,
            "month": 11,
            "year": 2022
        },
        {
            "authors": "Ajay Patel, Bryan Li, Mohammad Sadegh Rasooli, Noah Constant, Colin Raffel, and Chris Callison-Burch",
            "url": "https://arxiv.org/abs/2209.14500",
            "title": "Bidirectional Language Models Are Also Few-shot Learners",
            "venue": "11th International Conference on Learning Representations (ICML)",
            "day": 1,
            "month": 5,
            "year": 2023
        },
        {
            "authors": "Alexander Borzunov*, Dmitry Baranchuk*, Tim Dettmers*, Max Ryabinin*, Younes Belkada*, Artem Chumachenko, Pavel Samygin, and Colin Raffel",
            "url": "https://arxiv.org/abs/2209.01188",
            "title": "Petals: Collaborative Inference and Fine-tuning of Large Models",
            "venue": "61st Annual Meeting of the Association for Computational Linguistics (ACL) Demo Track and NeurIPS Workshop on Broadening Research Collaborations in Machine Learning",
            "note": "Best Paper Honorable Mention",
            "day": 3,
            "month": 12,
            "year": 2022
        },
        {
            "authors": "Marcos Treviso*, Tianchu Ji*, Ji-Ung Lee*, Betty van Aken, Qingqing Cao, Manuel R. Ciosici, Michael Hassid, Kenneth Heafield, Sara Hooker, Pedro H. Martins, André F. T. Martins, Peter Milder, Colin Raffel, Edwin Simpson, Noam Slonim, Niranjan Balasubramanian, Leon Derczynski, and Roy Schwartz",
            "url": "https://arxiv.org/abs/2209.00099",
            "title": "Efficient Methods for Natural Language Processing: A Survey",
            "venue": "Transactions of the Association for Computational Linguistics (TACL)",
            "day": 30,
            "month": 7,
            "year": 2023
        },
        {
            "authors": "Aarohi Srivastava, Abhinav Rastogi, Abhishek Rao, Abu Awal Md Shoeb, Abubakar Abid, Adam Fisch, Adam R. Brown, Adam Santoro, Aditya Gupta, Adrià Garriga-Alonso, Agnieszka Kluska, Aitor Lewkowycz, Akshat Agarwal, Alethea Power, Alex Ray, Alex Warstadt, Alexander W. Kocurek, Ali Safaya, Ali Tazarv, Alice Xiang, Alicia Parrish, Allen Nie, Aman Hussain, Amanda Askell, Amanda Dsouza, Ambrose Slone, Ameet Rahane, Anantharaman S. Iyer, Anders Andreassen, Andrea Madotto, Andrea Santilli, Andreas Stuhlmüller, Andrew Dai, Andrew La, Andrew Lampinen, Andy Zou, Angela Jiang, Angelica Chen, Anh Vuong, Animesh Gupta, Anna Gottardi, Antonio Norelli, Anu Venkatesh, Arash Gholamidavoodi, Arfa Tabassum, Arul Menezes, Arun Kirubarajan, Asher Mullokandov, Ashish Sabharwal, Austin Herrick, Avia Efrat, Aykut Erdem, Ayla Karakaş, B. Ryan Roberts, Bao Sheng Loe, Barret Zoph, Bartłomiej Bojanowski, Batuhan Özyurt, Behnam Hedayatnia, Behnam Neyshabur, Benjamin Inden, Benno Stein, Berk Ekmekci, Bill Yuchen Lin, Blake Howald, Cameron Diao, Cameron Dour, Catherine Stinson, Cedrick Argueta, César Ferri Ramírez, Chandan Singh, Charles Rathkopf, Chenlin Meng, Chitta Baral, Chiyu Wu, Chris Callison-Burch, Chris Waites, Christian Voigt, Christopher D. Manning, Christopher Potts, Cindy Ramirez, Clara E. Rivera, Clemencia Siro, Colin Raffel, Courtney Ashcraft, Cristina Garbacea, Damien Sileo, Dan Garrette, Dan Hendrycks, Dan Kilman, Dan Roth, Daniel Freeman, Daniel Khashabi, Daniel Levy, Daniel Moseguí González, Danielle Perszyk, Danny Hernandez, Danqi Chen, Daphne Ippolito, Dar Gilboa , David Dohan, David Drakard, David Jurgens, Debajyoti Datta, Deep Ganguli, Denis Emelin, Denis Kleyko, Deniz Yuret, Derek Chen, Derek Tam, Dieuwke Hupkes, Diganta Misra, Dilyar Buzan, Dimitri Coelho Mollo, Diyi Yang, Dong-Ho Lee, Ekaterina Shutova, Ekin Dogus Cubuk, Elad Segal, Eleanor Hagerman, Elizabeth Barnes, Elizabeth Donoway, Ellie Pavlick, Emanuele Rodola, Emma Lam, Eric Chu, Eric Tang, Erkut Erdem, Ernie Chang, Ethan A. Chi, Ethan Dyer, Ethan Jerzak, Ethan Kim, Eunice Engefu Manyasi, Evgenii Zheltonozhskii, Fanyue Xia, Fatemeh Siar, Fernando Martínez-Plumed, Francesca Happé, Francois Chollet, Frieda Rong, Gaurav Mishra, Genta Indra Winata, Gerard de Melo, Germán Kruszewski, Giambattista Parascandolo, Giorgio Mariani, Gloria Wang, Gonzalo Jaimovitch-López, Gregor Betz, Guy Gur-Ari, Hana Galijasevic, Hannah Kim, Hannah Rashkin, Hannaneh Hajishirzi, Harsh Mehta, Hayden Bogar, Henry Shevlin, Hinrich Schütze, Hiromu Yakura, Hongming Zhang, Hugh Mee Wong, Ian Ng, Isaac Noble, Jaap Jumelet, Jack Geissinger, Jackson Kernion, Jacob Hilton, Jaehoon Lee, Jaime Fernández Fisac, James B. Simon, James Koppel, James Zheng, James Zou, Jan Kocoń, Jana Thompson, Jared Kaplan, Jarema Radom, Jascha Sohl-Dickstein, Jason Phang, Jason Wei, Jason Yosinski, Jekaterina Novikova, Jelle Bosscher, Jennifer Marsh, Jeremy Kim, Jeroen Taal, Jesse Engel, Jesujoba Alabi, Jiacheng Xu, Jiaming Song, Jillian Tang, Joan Waweru, John Burden, John Miller, John U. Balis, Jonathan Berant, Jörg Frohberg, Jos Rozen, Jose Hernandez-Orallo, Joseph Boudeman, Joseph Jones, Joshua B. Tenenbaum, Joshua S. Rule, Joyce Chua, Kamil Kanclerz, Karen Livescu, Karl Krauth, Karthik Gopalakrishnan, Katerina Ignatyeva, Katja Markert, Kaustubh D. Dhole, Kevin Gimpel, Kevin Omondi, Kory Mathewson, Kristen Chiafullo, Ksenia Shkaruta, Kumar Shridhar, Kyle McDonell, Kyle Richardson, Laria Reynolds, Leo Gao, Li Zhang, Liam Dugan, Lianhui Qin, Lidia Contreras-Ochando, Louis-Philippe Morency, Luca Moschella, Lucas Lam, Lucy Noble, Ludwig Schmidt, Luheng He, Luis Oliveros Colón, Luke Metz, Lütfi Kerem Şenel, Maarten Bosma, Maarten Sap, Maartje ter Hoeve, Maheen Farooqi, Manaal Faruqui, Mantas Mazeika, Marco Baturan, Marco Marelli, Marco Maru, Maria Jose Ramírez Quintana, Marie Tolkiehn, Mario Giulianelli, Martha Lewis, Martin Potthast, Matthew L. Leavitt, Matthias Hagen, Mátyás Schubert, Medina Orduna Baitemirova, Melody Arnaud, Melvin McElrath, Michael A. Yee, Michael Cohen, Michael Gu, Michael Ivanitskiy, Michael Starritt, Michael Strube, Michał Swędrowski, Michele Bevilacqua, Michihiro Yasunaga, Mihir Kale, Mike Cain, Mimee Xu, Mirac Suzgun, Mo Tiwari, Mohit Bansal, Moin Aminnaseri, Mor Geva, Mozhdeh Gheini, Mukund Varma T, Nanyun Peng, Nathan Chi, Nayeon Lee, Neta Gur-Ari Krakover, Nicholas Cameron, Nicholas Roberts, Nick Doiron, Nikita Nangia, Niklas Deckers, Niklas Muennighoff, Nitish Shirish Keskar, Niveditha S. Iyer, Noah Constant, Noah Fiedel, Nuan Wen, Oliver Zhang, Omar Agha, Omar Elbaghdadi, Omer Levy, Owain Evans, Pablo Antonio Moreno Casares, Parth Doshi, Pascale Fung, Paul Pu Liang, Paul Vicol, Pegah Alipoormolabashi, Peiyuan Liao, Percy Liang, Peter Chang, Peter Eckersley, Phu Mon Htut, Pinyu Hwang, Piotr Miłkowski, Piyush Patil, Pouya Pezeshkpour, Priti Oli, Qiaozhu Mei, Qing Lyu, Qinlang Chen, Rabin Banjade, Rachel Etta Rudolph, Raefer Gabriel, Rahel Habacker, Ramón Risco Delgado, Raphaël Millière, Rhythm Garg, Richard Barnes, Rif A. Saurous, Riku Arakawa, Robbe Raymaekers, Robert Frank, Rohan Sikand, Roman Novak, Roman Sitelew, Ronan LeBras, Rosanne Liu, Rowan Jacobs, Rui Zhang, Ruslan Salakhutdinov, Ryan Chi, Ryan Lee, Ryan Stovall, Ryan Teehan, Rylan Yang, Sahib Singh, Saif M. Mohammad, Sajant Anand, Sam Dillavou, Sam Shleifer, Sam Wiseman, Samuel Gruetter, Samuel R. Bowman, Samuel S. Schoenholz, Sanghyun Han, Sanjeev Kwatra, Sarah A. Rous, Sarik Ghazarian, Sayan Ghosh, Sean Casey, Sebastian Bischoff, Sebastian Gehrmann, Sebastian Schuster, Sepideh Sadeghi, Shadi Hamdan, Sharon Zhou, Shashank Srivastava, Sherry Shi, Shikhar Singh, Shima Asaadi, Shixiang Shane Gu, Shubh Pachchigar, Shubham Toshniwal, Shyam Upadhyay, Shyamolima (Shammie)Debnath, Siamak Shakeri, Simon Thormeyer, Simone Melzi, Siva Reddy, Sneha Priscilla Makini, Soo-Hwan Lee, Spencer Torene, Sriharsha Hatwar, Stanislas Dehaene, Stefan Divic, Stefano Ermon, Stella Biderman, Stephanie Lin, Stephen Prasad, Steven T. Piantadosi, Stuart M. Shieber, Summer Misherghi, Svetlana Kiritchenko, Swaroop Mishra, Tal Linzen, Tal Schuster, Tao Li, Tao Yu, Tariq Ali, Tatsu Hashimoto, Te-Lin Wu, Théo Desbordes, Theodore Rothschild, Thomas Phan, Tianle Wang, Tiberius Nkinyili, Timo Schick, Timofei Kornev, Timothy Telleen-Lawton, Titus Tunduny, Tobias Gerstenberg, Trenton Chang, Trishala Neeraj, Tushar Khot, Tyler Shultz, Uri Shaham, Vedant Misra, Vera Demberg, Victoria Nyamai, Vikas Raunak, Vinay Ramasesh, Vinay Uday Prabhu, Vishakh Padmakumar, Vivek Srikumar, William Fedus, William Saunders, William Zhang, Wout Vossen, Xiang Ren, Xiaoyu Tong, Xinran Zhao, Xinyi Wu, Xudong Shen, Yadollah Yaghoobzadeh, Yair Lakretz, Yangqiu Song, Yasaman Bahri, Yejin Choi, Yichi Yang, Yiding Hao, Yifu Chen, Yonatan Belinkov, Yu Hou, Yufang Hou, Yuntao Bai, Zachary Seid, Zhuoye Zhao, Zijian Wang, Zijie J. Wang, Zirui Wang, and Ziyi Wu",
            "url": "https://arxiv.org/abs/2206.04615",
            "title": "Beyond the Imitation Game: Quantifying and extrapolating the capabilities of language models",
            "venue": "Transactions on Machine Learning Research (TMLR)",
            "day": 11,
            "month": 5,
            "year": 2023
        },
        {
            "authors": "Jason Wei, Yi Tay, Rishi Bommasani, Colin Raffel, Barret Zoph, Sebastian Borgeaud, Dani Yogatama, Maarten Bosma, Denny Zhou, Donald Metzler, Ed H Chi, Tatsunori Hashimoto, Oriol Vinyals, Percy Liang, Jeff Dean, William Fedus",
            "url": "https://arxiv.org/abs/2206.07682",
            "title": "Emergent Abilities of Large Language Models",
            "venue": "Transactions on Machine Learning Research (TMLR)",
            "day": 25,
            "month": 8,
            "year": 2022
        },
        {
            "authors": "Haokun Liu*, Derek Tam*, Mohammed Muqeeth*, Jay Mohta, Tenghao Huang, Mohit Bansal, and Colin Raffel",
            "url": "https://arxiv.org/abs/2205.05638",
            "title": "Few-Shot Parameter-Efficient Fine-Tuning is Better and Cheaper than In-Context Learning",
            "venue": "Neural Information Processing Systems 36 (NeurIPS)",
            "day": 29,
            "month": 11,
            "year": 2022
        },
        {
            "authors": "Thomas Wang*, Adam Roberts*, Daniel Hesslow, Teven Le Scao, Hyung Won Chung, Iz Beltagy, Julien Launay, and Colin Raffel",
            "url": "https://arxiv.org/abs/2204.05832",
            "title": "What Language Model Architecture and Pretraining Objective Work Best for Zero-Shot Generalization?",
            "venue": "39th International Conference on Machine Learning (ICML)",
            "day": 17,
            "month": 7,
            "year": 2022
        },
        {
            "authors": "Teven Le Scao*, Thomas Wang*, Daniel Hesslow*, Lucile Saulnier*, Stas Bekman*, M Saiful Bari, Stella Biderman, Hady Elsahar, Jason Phang, Ofir Press, Colin Raffel, Victor Sanh, Sheng Shen, Lintang Sutawika, Jaesung Tae, Zheng Xin Yong, Julien Launay, Iz Beltagy",
            "url": "https://openreview.net/forum?id=rI7BL3fHIZq",
            "title": "What Language Model to Train if You Have One Million GPU Hours?",
            "venue": "Findings of the 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP)",
            "day": 7,
            "month": 12,
            "year": 2022
        },
        {
            "authors": "Adam Roberts, Hyung Won Chung, Anselm Levskaya, Gaurav Mishra, James Bradbury, Daniel Andor, Sharan Narang, Brian Lester, Colin Gaffney, Afroz Mohiuddin, Curtis Hawthorne, Aitor Lewkowycz, Alex Salcianu, Marc van Zee, Jacob Austin, Sebastian Goodman, Livio Baldini Soares, Haitang Hu, Sasha Tsvyashchenko, Aakanksha Chowdhery, Jasmijn Bastings, Jannis Bulian, Xavier Garcia, Jianmo Ni, Andrew Chen, Kathleen Kenealy, Jonathan H. Clark, Stephan Lee, Dan Garrette, James Lee-Thorp, Colin Raffel, Noam Shazeer, Marvin Ritter, Maarten Bosma, Alexandre Passos, Jeremy Maitin-Shepard, Noah Fiedel, Mark Omernick, Brennan Saeta, Ryan Sepassi, Alexander Spiridonov, Joshua Newlan, and Andrea Gesmundo",
            "url": "https://arxiv.org/abs/2203.17189",
            "title": "Scaling Up Models and Data with t5x and seqio",
            "venue": "arXiv preprint arXiv:2203.17189",
            "day": 31,
            "month": 3,
            "year": 2022
        },
        {
            "authors": "Stephen H. Bach*, Victor Sanh*, Zheng-Xin Yong, Albert Webson, Colin Raffel, Nihal V. Nayak, Abheesht Sharma, Taewoon Kim, M Saiful Bari, Thibault Fevry, Zaid Alyafeai, Manan Dey, Andrea Santilli, Zhiqing Sun, Srulik Ben-David, Canwen Xu, Gunjan Chhablani, Han Wang, Jason Alan Fries, Maged S. Al-shaibani, Shanya Sharma, Urmish Thakker, Khalid Almubarak, Xiangru Tang, Dragomir Radev, Mike Tian-Jian Jiang, and Alexander M. Rush",
            "url": "https://arxiv.org/abs/2202.01279",
            "title": "PromptSource: An Integrated Development Environment and Repository for Natural Language Prompts",
            "venue": "60th Annual Meeting of the Association for Computational Linguistics (ACL) Demo Track",
            "day": 22,
            "month": 5,
            "year": 2022
        },
        {
            "authors": "Nikhil Kandpal, Eric Wallace, and Colin Raffel",
            "url": "https://arxiv.org/abs/2202.06539",
            "title": "Deduplicating Training Data Mitigates Privacy Risks in Language Models",
            "venue": "39th International Conference on Machine Learning (ICML)",
            "day": 17,
            "month": 7,
            "year": 2022
        },
        {
            "authors": "Sabrina J. Mielke, Zaid Alyafeai, Elizabeth Salesky, Colin Raffel, Manan Dey, Matthias Gallé, Arun Raja, Chenglei Si, Wilson Y. Lee, Benoît Sagot, and Samson Tan",
            "url": "https://arxiv.org/abs/2112.10508",
            "title": "Between words and characters: A Brief History of Open-Vocabulary Modeling and Tokenization in NLP",
            "venue": "arXiv preprint arxiv:2112.10508",
            "day": 20,
            "month": 12,
            "year": 2021
        },
        {
            "authors": "Yi-Lin Sung*, Varun Nair*, and Colin Raffel",
            "url": "https://arxiv.org/abs/2111.09839",
            "title": "Training Neural Networks with Fixed Sparse Masks",
            "venue": "Neural Information Processing Systems 35 (NeurIPS)",
            "day": 6,
            "month": 12,
            "year": 2021
        },
        {
            "authors": "Michael Matena and Colin Raffel",
            "url": "https://arxiv.org/abs/2111.09832",
            "title": "Merging Models with Fisher-Weighted Averaging",
            "venue": "Neural Information Processing Systems 36 (NeurIPS)",
            "day": 29,
            "month": 11,
            "year": 2022
        },
        {
            "authors": "Victor Sanh*, Albert Webson*, Colin Raffel*, Stephen H. Bach*, Lintang Sutawika, Zaid Alyafeai, Antoine Chaffin, Arnaud Stiegler, Teven Le Scao, Arun Raja, Manan Dey, M Saiful Bari, Canwen Xu, Urmish Thakker, Shanya Sharma Sharma, Eliza Szczechla, Taewoon Kim, Gunjan Chhablani, Nihal Nayak, Debajyoti Datta, Jonathan Chang, Mike Tian-Jian Jiang, Han Wang, Matteo Manica, Sheng Shen, Zheng Xin Yong, Harshit Pandey, Rachel Bawden, Thomas Wang, Trishala Neeraj, Jos Rozen, Abheesht Sharma, Andrea Santilli, Thibault Fevry, Jason Alan Fries, Ryan Teehan, Stella Biderman, Leo Gao, Tali Bers, Thomas Wolf, and Alexander M. Rush",
            "url": "https://arxiv.org/abs/2110.08207",
            "title": "Multitask Prompted Training Enables Zero-Shot Task Generalization",
            "venue": "10th International Conference on Learning Representations (ICLR)",
            "day": 25,
            "month": 4,
            "year": 2022
        },
        {
            "authors": "Jiaao Chen*, Derek Tam*, Colin Raffel, Mohit Bansal, and Diyi Yang",
            "url": "https://arxiv.org/abs/2106.07499",
            "title": "An Empirical Survey of Data Augmentation for Limited Data Learning in NLP",
            "venue": "Transactions of the Association for Computational Linguistics (TACL)",
            "day": 27,
            "month": 11,
            "year": 2022
        },
        {
            "authors": "Ching-Yuan Bai, Hsuan-Tien Lin, Colin Raffel, and Wendy Chih-wen Kan",
            "url": "https://arxiv.org/abs/2106.03062",
            "title": "On Training Sample Memorization: Lessons from Benchmarking Generative Modeling with a Large-scale Competition",
            "venue": "27th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD)",
            "day": 18,
            "month": 8,
            "year": 2021
        },
        {
            "authors": "Linting Xue*, Aditya Barua*, Noah Constant*, Rami Al-Rfou*, Sharan Narang, Mihir Kale, Adam Roberts, and Colin Raffel",
            "url": "https://arxiv.org/abs/2105.13626",
            "title": "ByT5: Towards a token-free future with pre-trained byte-to-byte models",
            "venue": "Transactions of the Association for Computational Linguistics (TACL)",
            "day": 1,
            "month": 1,
            "year": 2022
        },
        {
            "authors": "Derek Tam*, Rakesh R Menon*, Mohit Bansal, Shashank Srivastava, and Colin Raffel",
            "url": "https://arxiv.org/abs/2103.11955",
            "title": "Improving and Simplifying Pattern Exploiting Training",
            "venue": "2021 Conference on Empirical Methods in Natural Language Processing (EMNLP)",
            "day": 7,
            "month": 11,
            "year": 2021
        },
        {
            "authors": "Zhenlin Xu, Deyi Liu, Junlin Yang, Colin Raffel, and Marc Niethammer",
            "url": "http://colinraffel.com/publications/arxiv2020robust.pdf",
            "title": "Robust and Generalizable Visual Representation Learning via Random Convolutions",
            "venue": "9th International Conference on Learning Representations (ICLR)",
            "day": 3,
            "month": 5,
            "year": 2021
        },
        {
            "authors": "Sharan Narang, Hyung Won Chung, Yi Tay, William Fedus, Thibault Fevry, Michael Matena, Karishma Malkan, Noah Fiedel, Noam Shazeer, Zhenzhong Lan, Yanqi Zhou, Wei Li, Nan Ding, Jake Marcus, Adam Roberts, and Colin Raffel",
            "url": "https://arxiv.org/abs/2102.11972",
            "title": "Do Transformer Modifications Transfer Across Implementations and Applications?",
            "venue": "2021 Conference on Empirical Methods in Natural Language Processing (EMNLP)",
            "day": 7,
            "month": 11,
            "year": 2021
        },
        {
            "authors": "Colin Raffel and Kevin P. Murphy (ed.)",
            "url": "http://colinraffel.com/publications/probml2021learning.pdf",
            "title": "Learning with Fewer Labeled Examples",
            "venue": "Book chapter in Probabilistic Machine Learning: An Introduction",
            "day": 3,
            "month": 1,
            "year": 2021
        },
        {
            "authors": "Sewon Min, Jordan Boyd-Graber, Chris Alberti, Danqi Chen, Eunsol Choi, Michael Collins, Kelvin Guu, Hannaneh Hajishirzi, Kenton Lee, Jennimaria Palomaki, Colin Raffel, Adam Roberts, Tom Kwiatkowski, and EfficientQA Participants",
            "url": "https://arxiv.org/abs/2101.00133",
            "title": "NeurIPS 2020 EfficientQA Competition: Systems, Analyses and Lessons Learned",
            "venue": "Proceedings of Machine Learning Research (PMLR), NeurIPS 2020 Competition and Demonstration Track",
            "day": 6,
            "month": 12,
            "year": 2020
        },
        {
            "authors": "Nicholas Carlini, Florian Tramer, Eric Wallace, Matthew Jagielski, Ariel Herbert-Voss, Katherine Lee, Adam Roberts, Tom Brown, Dawn Song, Ulfar Erlingsson, Alina Oprea, and Colin Raffel",
            "url": "https://arxiv.org/abs/2012.07805",
            "title": "Extracting Training Data from Large Language Models",
            "venue": "30th USENIX Security Symposium",
            "day": 11,
            "month": 8,
            "year": 2021
        },
        {
            "authors": "Kihyuk Sohn*, David Berthelot*, Chun-Liang Li, Zizhao Zhang, Nicholas Carlini, Ekin D. Cubuk, Alex Kurakin, Han Zhang, and Colin Raffel",
            "url": "http://colinraffel.com/publications/neurips2020fixmatch.pdf",
            "title": "FixMatch: Simplifying Semi-Supervised Learning with Consistency and Confidence",
            "venue": "Neural Information Processing Systems 34 (NeurIPS)",
            "day": 7,
            "month": 12,
            "year": 2020
        },
        {
            "authors": "Samarth Sinha, Anirudh Goyal, Colin Raffel, and Augustus Odena",
            "url": "http://colinraffel.com/publications/neurips2020top.pdf",
            "title": "Top-k Training of GANs: Improving GAN Performance by Throwing Away Bad Samples",
            "venue": "Neural Information Processing Systems 34 (NeurIPS)",
            "day": 7,
            "month": 12,
            "year": 2020
        },
        {
            "authors": "Linting Xue*, Noah Constant*, Adam Roberts*, Mihir Kale, Rami Al-Rfou, Aditya Siddhant, Aditya Barua, and Colin Raffel",
            "url": "http://colinraffel.com/publications/arxiv2020mt5.pdf",
            "title": "mT5: A Massively Multilingual Pre-Trained Text-to-Text Transformer",
            "venue": "2021 Conference of the North American Chapter of the Association for Computational Linguistics (NAACL)",
            "day": 6,
            "month": 6,
            "year": 2021
        },
        {
            "authors": "Colin Raffel*, Noam Shazeer*, Adam Roberts*, Katherine Lee*, Sharan Narang, Michael Matena, Yanqi Zhou, Wei Li, and Peter J. Liu",
            "url": "http://colinraffel.com/publications/jmlr2020exploring.pdf",
            "title": "Exploring the Limits of Transfer Learning with a Unified Text-to-Text Transformer",
            "venue": "Journal of Machine Learning Research (JMLR), 21(140)",
            "day": 26,
            "month": 7,
            "year": 2020
        },
        {
            "authors": "Sharan Narang*, Colin Raffel*, Katherine Lee, Adam Roberts, Noah Fiedel, and Karishma Malkan",
            "url": "http://colinraffel.com/publications/arxiv2020wt5.pdf",
            "title": "WT5?! Training Text-to-Text Models to Explain their Predictions",
            "venue": "arXiv preprint arXiv:2004.14546",
            "day": 30,
            "month": 3,
            "year": 2020
        },
        {
            "authors": "Martin Maas, David G. Andersen, Michael Isard, Mohammad Mahdi Javanmard, Kathryn S. McKinley, and Colin Raffel",
            "url": "http://colinraffel.com/publications/asplos2020learning.pdf",
            "title": "Learning-based Memory Allocation for C++ Server Workloads",
            "venue": "25th International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS)",
            "day": 16,
            "month": 3,
            "year": 2020,
            "note": "SIGPLAN Research Highlight"
        },
        {
            "authors": "Yao Qin, Nicholas Frosst, Colin Raffel, Garrison Cottrell, and Geoffrey Hinton",
            "url": "http://colinraffel.com/publications/arxiv2020deflecting.pdf",
            "title": "Deflecting Adversarial Attacks",
            "venue": "arXiv preprint arXiv:2002.07405",
            "day": 18,
            "month": 2,
            "year": 2020
        },
        {
            "authors": "Adam Roberts*, Colin Raffel*, and Noam Shazeer",
            "url": "http://colinraffel.com/publications/emnlp2020how.pdf",
            "title": "How Much Knowledge Can You Pack Into the Parameters of a Language Model?",
            "venue": "2020 Conference on Empirical Methods in Natural Language Processing (EMNLP)",
            "day": 16,
            "month": 11,
            "year": 2020
        },
        {
            "authors": "David Berthelot, Nicholas Carlini, Ekin D. Cubuk, Alex Kurakin, Kihyuk Sohn, Han Zhang, and Colin Raffel",
            "url": "http://colinraffel.com/publications/iclr2020remixmatch.pdf",
            "title": "ReMixMatch: Semi-Supervised Learning with Distribution Alignment and Augmentation Anchoring",
            "venue": "8th International Conference on Learning Representations (ICLR)",
            "day": 26,
            "month": 4,
            "year": 2020
        },
        {
            "authors": "Yao Qin*, Nicholas Frosst*, Sara Sabour, Colin Raffel, Garrison Cottrell, and Geoffrey Hinton",
            "url": "http://colinraffel.com/publications/iclr2020detecting.pdf",
            "title": "Detecting and Diagnosing Adversarial Images with Class-Conditional Capsule Reconstructions",
            "venue": "8th International Conference on Learning Representations (ICLR)",
            "day": 26,
            "month": 4,
            "year": 2020
        },
        {
            "authors": "David Berthelot, Nicholas Carlini, Ian Goodfellow, Nicolas Papernot, Avital Oliver, and Colin Raffel",
            "url": "http://colinraffel.com/publications/neurips2019mixmatch.pdf",
            "title": "MixMatch: A Holistic Approach to Semi-Supervised Learning",
            "venue": "Neural Information Processing Systems 33 (NeurIPS)",
            "day": 9,
            "month": 12,
            "year": 2019
        },
        {
            "authors": "Naveen Arivazhagan*, Colin Cherry*, Wolfgang Macherey, Chung-Cheng Chiu, Semih Yavuz, Ruoming Pang, Wei Li, and Colin Raffel",
            "url": "http://colinraffel.com/publications/acl2019monotonic.pdf",
            "title": "Monotonic Infinite Lookback Attention for Simultaneous Machine Translation",
            "venue": "57th Annual Meeting of the Association for Computational Linguistics (ACL)",
            "day": 28,
            "month": 7,
            "year": 2019
        },
        {
            "authors": "Yao Qin, Nicholas Carlini, Ian Goodfellow, Garrison Cottrell, and Colin Raffel",
            "url": "http://colinraffel.com/publications/icml2019imperceptible.pdf",
            "title": "Imperceptible, Robust, and Targeted Adversarial Examples for Automatic Speech Recognition",
            "venue": "36th International Conference on Machine Learning (ICML)",
            "day": 9,
            "month": 6,
            "year": 2019
        },
        {
            "authors": "Vaishnavh Nagarajan, Colin Raffel, and Ian J. Goodfellow",
            "url": "http://colinraffel.com/publications/idlt2018theoretical.pdf",
            "title": "Theoretical Insights into Memorization in GANs",
            "venue": "NeurIPS Workshop on Integration of Deep Learning Theories",
            "day": 8,
            "month": 12,
            "year": 2018
        },
        {
            "authors": "David Berthelot*, Colin Raffel*, Aurko Roy, and Ian Goodfellow",
            "url": "http://colinraffel.com/publications/iclr2019understanding.pdf",
            "title": "Understanding and Improving Interpolation in Autoencoders via an Adversarial Regularizer",
            "venue": "7th International Conference on Learning Representations (ICLR)",
            "day": 6,
            "month": 5,
            "year": 2019
        },
        {
            "authors": "Ishaan Gulrajani, Colin Raffel, and Luke Metz",
            "url": "http://colinraffel.com/publications/iclr2019towards.pdf",
            "title": "Towards GAN Benchmarks Which Require Generalization",
            "venue": "7th International Conference on Learning Representations (ICLR)",
            "day": 6,
            "month": 5,
            "year": 2019
        },
        {
            "authors": "Avital Oliver*, Augustus Odena*, Colin Raffel*, Ekin D. Cubuk, and Ian J. Goodfellow",
            "url": "http://colinraffel.com/publications/neurips2018realistic.pdf",
            "title": "Realistic Evaluation of Deep Semi-Supervised Learning Algorithms",
            "venue": "Neural Information Processing Systems 32 (NeurIPS)",
            "day": 3,
            "month": 12,
            "year": 2018
        },
        {
            "authors": "Ian Simon, Adam Roberts, Colin Raffel, Jesse Engel, Curtis Hawthorne, and Douglas Eck",
            "url": "http://colinraffel.com/publications/arxiv2018learning.pdf",
            "title": "Learning a Latent Space of Multitrack Measures",
            "venue": "2nd NeurIPS Workshop on Machine Learning for Creativity and Design",
            "day": 3,
            "month": 12,
            "year": 2018
        },
        {
            "authors": "Adam Roberts, Jesse Engel, Colin Raffel, Curtis Hawthorne, and Douglas Eck",
            "url": "http://colinraffel.com/publications/icml2018hierarchical.pdf",
            "title": "A Hierarchical Latent Vector Model for Learning Long-Term Structure in Music",
            "venue": "35th International Conference on Machine Learning (ICML)",
            "day": 10,
            "month": 7,
            "year": 2018
        },
        {
            "authors": "Augustus Odena, Jacob Buckman, Catherine Olsson, Tom B. Brown, Christopher Olah, Colin Raffel, and Ian Goodfellow",
            "url": "http://colinraffel.com/publications/icml2018generator.pdf",
            "title": "Is Generator Conditioning Causally Related to GAN Performance?",
            "venue": "35th International Conference on Machine Learning (ICML)",
            "day": 10,
            "month": 7,
            "year": 2018
        },
        {
            "authors": "Chung-Cheng Chiu* and Colin Raffel*",
            "url": "http://colinraffel.com/publications/iclr2018monotonic.pdf",
            "title": "Monotonic Chunkwise Attention",
            "venue": "6th International Conference on Learning Representations (ICLR)",
            "day": 30,
            "month": 4,
            "year": 2018
        },
        {
            "authors": "Jacob Buckman*, Aurko Roy*, Colin Raffel, and Ian J. Goodfellow",
            "url": "http://colinraffel.com/publications/iclr2018thermometer.pdf",
            "title": "Thermometer Encoding: One Hot Way To Resist Adversarial Examples",
            "venue": "6th International Conference on Learning Representations (ICLR)",
            "day": 30,
            "month": 4,
            "year": 2018
        },
        {
            "authors": "Dieterich Lawson*, George Tucker*, Chung-Cheng Chiu*, Colin Raffel, Kevin Swersky, and Navdeep Jaitly",
            "url": "http://colinraffel.com/publications/icassp2018learning.pdf",
            "title": "Learning Hard Alignments with Variational Inference",
            "venue": "43rd IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP)",
            "day": 15,
            "month": 4,
            "year": 2018
        },
        {
            "authors": "Curtis Hawthorne*, Erich Elsen*, Jialin Song*, Adam Roberts, Ian Simon, Colin Raffel, Jesse Engel, Sageev Oore, and Douglas Eck",
            "url": "http://colinraffel.com/publications/ismir2018onsets.pdf",
            "title": "Onsets and Frames: Dual-Objective Piano Transcription",
            "venue": "19th International Society for Music Information Retrieval Conference (ISMIR)",
            "day": 23,
            "month": 9,
            "year": 2018
        },
        {
            "authors": "Colin Raffel, Minh-Thang Luong, Peter J. Liu, Ron J. Weiss, and Douglas Eck",
            "url": "http://colinraffel.com/publications/icml2017online.pdf",
            "title": "Online and Linear-Time Attention by Enforcing Monotonic Alignments",
            "venue": "34th International Conference on Machine Learning (ICML)",
            "day": 6,
            "month": 8,
            "year": 2017,
            "code_url": "https://github.com/craffel/mad"
        },
        {
            "authors": "Colin Raffel and Dieterich Lawson",
            "url": "http://colinraffel.com/publications/iclr2017training.pdf",
            "title": "Training a Subsampling Mechanism in Expectation",
            "venue": "5th International Conference on Learning Representations Workshop (ICLR)",
            "day": 24,
            "month": 4,
            "year": 2017,
            "code_url": "https://github.com/craffel/subsampling_in_expectation"
        },
        {
            "authors": "Justin Gilmer, Colin Raffel, Samuel S. Schoenholz, Maithra Raghu, and Jascha Sohl-Dickstein",
            "url": "http://colinraffel.com/publications/iclr2017explaining.pdf",
            "title": "Explaining the Learning Dynamics of Direct Feedback Alignment",
            "venue": "5th International Conference on Learning Representations Workshop (ICLR)",
            "day": 24,
            "month": 4,
            "year": 2017
        },
        {
            "authors": "Colin Raffel and Daniel P. W. Ellis",
            "url": "http://colinraffel.com/publications/ismir2016extracting.pdf",
            "title": "Extracting Ground Truth Information from MIDI Files: A MIDIfesto",
            "venue": "17th International Society for Music Information Retrieval Conference (ISMIR)",
            "day": 10,
            "month": 8,
            "year": 2016,
            "code_url": "http://github.com/craffel/midi-ground-truth"
        },
        {
            "authors": "Colin Raffel",
            "url": "http://colinraffel.com/publications/thesis.pdf",
            "title": "Learning-Based Methods for Comparing Sequences, with Applications to Audio-to-MIDI Alignment and Matching",
            "venue": "Ph.D. Thesis",
            "day": 12,
            "month": 7,
            "year": 2016,
            "code_url": "http://github.com/craffel/midi-dataset"
        },
        {
            "authors": "Colin Raffel and Daniel P. W. Ellis",
            "url": "http://colinraffel.com/publications/iclr2016feed.pdf",
            "title": "Feed-Forward Networks with Attention Can Solve Some Long-Term Memory Problems",
            "venue": "4th International Conference on Learning Representations Workshop (ICLR)",
            "day": 2,
            "month": 5,
            "year": 2016
        },
        {
            "authors": "Colin Raffel and Daniel P. W. Ellis",
            "url": "http://colinraffel.com/publications/icassp2016pruning.pdf",
            "title": "Pruning Subsequence Search with Attention-Based Embedding",
            "venue": "41st IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP)",
            "day": 22,
            "month": 3,
            "year": 2016
        },
        {
            "authors": "Colin Raffel and Daniel P. W. Ellis",
            "url": "http://colinraffel.com/publications/icassp2016optimizing.pdf",
            "title": "Optimizing DTW-Based Audio-to-MIDI Alignment and Matching",
            "venue": "41st IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP)",
            "day": 22,
            "month": 3,
            "year": 2016
        },
        {
            "authors": "Nikolai Yakovenko, Liangliang Cao, Colin Raffel, and James Fan",
            "url": "http://colinraffel.com/publications/aaai2016poker.pdf",
            "title": "Poker-CNN: A Pattern Learning Strategy for Making Draws and Bets in Poker Games",
            "venue": "30th AAAI Conference on Artificial Intelligence",
            "day": 17,
            "month": 2,
            "year": 2016
        },
        {
            "authors": "Colin Raffel and Daniel P. W. Ellis",
            "url": "http://colinraffel.com/publications/neurips2015accelerating.pdf",
            "title": "Accelerating Multimodal Sequence Retrieval with Convolutional Networks",
            "venue": "NeurIPS Multimodal Machine Learning Workshop",
            "day": 11,
            "month": 12,
            "year": 2015
        },
        {
            "authors": "Andreas Jansson, Colin Raffel, and Tillman Weyde",
            "url": "http://colinraffel.com/publications/ismir2015this.pdf",
            "title": "This Is My Jam: Data Dump",
            "venue": "16th International Society for Music Information Retrieval Conference Late Breaking and Demo Papers",
            "day": 30,
            "month": 10,
            "year": 2015
        },
        {
            "authors": "Colin Raffel and Daniel P. W. Ellis",
            "url": "http://colinraffel.com/publications/ismir2015large.pdf",
            "title": "Large-Scale Content-Based Matching of MIDI and Audio Files",
            "venue": "16th International Society for Music Information Retrieval Conference (ISMIR)",
            "day": 27,
            "month": 10,
            "year": 2015,
            "code_url": "http://github.com/craffel/midi-dataset",
            "note": "Best Student Paper Award"
        },
        {
            "authors": "Brian McFee, Colin Raffel, Dawen Liang, Daniel P. W. Ellis, Matt McVicar, and Oriol Nieto",
            "url": "http://colinraffel.com/publications/scipy2015librosa.pdf",
            "title": "librosa: Audio and Music Signal Analysis in Python",
            "venue": "14th Python in Science Conference (SciPy)",
            "day": 8,
            "month": 7,
            "year": 2015
        },
        {
            "authors": "Colin Raffel and Daniel P. W. Ellis",
            "url": "http://colinraffel.com/publications/ismir2014intuitive.pdf",
            "title": "Intuitive Analysis, Creation and Manipulation of MIDI Data with pretty_midi",
            "venue": "15th International Society for Music Information Retrieval Conference Late Breaking and Demo Papers",
            "day": 31,
            "month": 10,
            "year": 2014
        },
        {
            "authors": "Colin Raffel, Brian McFee, Eric J. Humphrey, Justin Salamon, Oriol Nieto, Dawen Liang, and Daniel P. W. Ellis",
            "url": "http://colinraffel.com/publications/ismir2014mir_eval.pdf",
            "title": "mir_eval: A Transparent Implementation of Common MIR Metrics",
            "venue": "15th International Society for Music Information Retrieval Conference (ISMIR)",
            "day": 29,
            "month": 10,
            "year": 2014,
            "note": "Best Poster Presentation Award"
        },
        {
            "authors": "Colin Raffel and Daniel P. W. Ellis",
            "url": "http://colinraffel.com/publications/icassp2014estimating.pdf",
            "title": "Estimating Timing and Channel Distortion Across Related Signals",
            "venue": "39th IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP)",
            "day": 6,
            "month": 5,
            "year": 2014,
            "code_url": "http://github.com/craffel/remixavier"
        },
        {
            "authors": "Colin Raffel",
            "url": "http://colinraffel.com/publications/aes2010using.pdf",
            "title": "Using Noise Substitution for Backwards-Compatible Audio Codec Improvement",
            "venue": "129th Convention of the Audio Engineering Society (AES)",
            "day": 7,
            "month": 11,
            "year": 2010
        },
        {
            "authors": "Colin Raffel and Julius O. Smith",
            "url": "http://colinraffel.com/publications/dafx2010practical.pdf",
            "title": "Practical Modeling of Bucket-Brigade Device Circuits",
            "venue": "13th International Conference on Digital Audio Effects (DAFx)",
            "day": 6,
            "month": 9,
            "year": 2010
        },
        {
            "authors": "Colin Raffel, Nick Kruge, Diane Douglas, Edgar Berdahl, and Wendy Ju",
            "url": "http://colinraffel.com/publications/icmc2010the.pdf",
            "title": "The Lattice Harp: A New Hybrid Instrument and Controller",
            "venue": "35th International Computer Music Conference (ICMC)",
            "day": 1,
            "month": 6,
            "year": 2010,
            "code_url": "http://github.com/craffel/lattice-harp"
        }
    ]
}



